clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_cg.c
/**
 *******************************************************************************
 * @file    tmpm36b_cg.c
 * @brief   This file provides API functions for CG driver 
 * @version V2.0.2.4
 * @date    2014/05/20
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2014 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm36b_cg.h"

#if defined(__TMPM36B_CG_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup CG
  * @brief CG driver modules
  * @{
  */

/** @defgroup CG_Private_Defines
  * @{
  */
#define CG_FC_GEAR_MASK                      ((uint32_t)0xFFFFFFF8)
#define CG_PRCK_MASK                         ((uint32_t)0xFFFFF8FF)
#define CG_SCOUT_MASK                        ((uint32_t)0xFFFCFFFF)
#define CG_WUP_TIME_MASK                     ((uint32_t)0x000F3FFF)
#define CG_WUP_COUNTER_MASK                  ((uint32_t)0xFFF7FFF7)
#define CG_OSCCR_WRITE0_MASK                 ((uint32_t)0xFFFFCF3F)
#define CG_OSCCR_WRITE1_MASK                 ((uint32_t)0x00000030)

#define CG_PLLSET_VALUE_MASK                 ((uint32_t)0x0000FFFE)

#define CG_STBY_MODE_MASK                    ((uint32_t)0xFFFFFFF8)
#define CG_STBY_WRITE0_MASK                  ((uint32_t)0xFFF3FFFF)
#define CG_NMIFLG_MASK                       ((uint32_t)0xFFFFFFF0)
#define CG_RESET_FLAG_MASK                   ((uint32_t)0xFFFFFF80)
#define CG_FPSEL_MASK                        ((uint32_t)0xFFFFEFFF)

#define FC_GEAR_1_1                          ((uint32_t)0x00000000)
#define FC_GEAR_1_2                          ((uint32_t)0x00000004)
#define FC_GEAR_1_4                          ((uint32_t)0x00000005)
#define FC_GEAR_1_8                          ((uint32_t)0x00000006)
#define FC_GEAR_1_16                         ((uint32_t)0x00000007)

#ifdef TSB_M36BFY
#define CG_FPLL_8M_MULTIPLY_6_VALUE          (0x00007117UL<<1U)
#define CG_FPLL_8M_MULTIPLY_10_VALUE         (0x000071A6UL<<1U)
#define CG_FPLL_10M_MULTIPLY_8_VALUE         (0x0000711EUL<<1U)
#define CG_FPLL_12M_MULTIPLY_4_VALUE         (0x0000610FUL<<1U)
#define CG_FPLL_12M_MULTIPLY_6_VALUE         (0x00006195UL<<1U)
#define CG_FPLL_16M_MULTIPLY_3_VALUE         (0x00006A8BUL<<1U)
#define CG_FPLL_16M_MULTIPLY_5_VALUE         (0x00007292UL<<1U)
#define CG_FPLL_VALUE_MAX                    ((uint32_t)0x00000007)
#elif defined (TSB_M36BF10 )
#define CG_FPLL_8M_MULTIPLY_8_VALUE          (0x0000789FUL<<1U)
#define CG_FPLL_8M_10M_MULTIPLY_6_VALUE      (0x00007817UL<<1U)
#define CG_FPLL_10M_MULTIPLY_4_VALUE         (0x0000780FUL<<1U)
#define CG_FPLL_12M_MULTIPLY_5_VALUE         (0x00007993UL<<1U)
#define CG_FPLL_12M_16M_MULTIPLY_4_VALUE     (0x0000790FUL<<1U)
#define CG_FPLL_16M_MULTIPLY_3_VALUE         (0x0000710BUL<<1U)
#define CG_FPLL_VALUE_MAX                    ((uint32_t)0x00000006)
#endif

#define WARM_UP_SEL_OSC_INT_HIGH             ((uint32_t)0x00000000)
#define WARM_UP_SEL_OSC_EXT_HIGH             ((uint32_t)0x00080000)
#define WARM_UP_SEL_OSC_EXT_LOW              ((uint32_t)0x00080008)


#define SCOUT_SRC_HALF_FSYS                  ((uint32_t)0x00010000)
#define SCOUT_SRC_FSYS                       ((uint32_t)0x00020000)
#define SCOUT_SRC_PHIT0                      ((uint32_t)0x00030000)

#define CG_PROTECT_SET                       ((uint32_t)0x000000C1)
#define CG_PROTECT_CLEAR                     ((uint32_t)0x0000003E)

#define CG_OSC_OFD_SET                       ((uint32_t)0x00000400)
#define CG_OSC_OFD_CLEAR                     ((uint32_t)0xFFFFFBFF)

typedef union {
    uint32_t byte4;
    uint8_t byte[4];
} CG_Byte4;

static CG_DivideLevel numToDivideLevel_table[CG_DIVIDE_MAX] = {
    CG_DIVIDE_1,
    CG_DIVIDE_2,
    CG_DIVIDE_4,
    CG_DIVIDE_8,
    CG_DIVIDE_16,
    CG_DIVIDE_32,
    CG_DIVIDE_64,
    CG_DIVIDE_128,
    CG_DIVIDE_256,
    CG_DIVIDE_512,
    CG_DIVIDE_UNKNOWN,
};

static CG_PhiT0Src numPhiT0Src_table[CG_PHIT0_SRC_MAX] = {
    CG_PHIT0_SRC_FGEAR,
    CG_PHIT0_SRC_FC,
};

static CG_STBYMode numToSTBYMode_table[CG_STBY_MODE_MAX] = {
    CG_STBY_MODE_UNKNOWN,
    CG_STBY_MODE_STOP1,
    CG_STBY_MODE_UNKNOWN,
    CG_STBY_MODE_IDLE,
    CG_STBY_MODE_UNKNOWN,
    CG_STBY_MODE_STOP2,
    CG_STBY_MODE_UNKNOWN,
    CG_STBY_MODE_UNKNOWN,
};

#ifdef TSB_M36BFY
static CG_FpllValue fpllValue_table[CG_FPLL_VALUE_MAX] = {
    CG_FPLL_8M_MULTIPLY_6,
    CG_FPLL_8M_MULTIPLY_10,
    CG_FPLL_10M_MULTIPLY_8,
    CG_FPLL_12M_MULTIPLY_4,
    CG_FPLL_12M_MULTIPLY_6,
    CG_FPLL_16M_MULTIPLY_3,
    CG_FPLL_16M_MULTIPLY_5,
};

static uint32_t numFpllValue_table[CG_FPLL_VALUE_MAX] = {
    CG_FPLL_8M_MULTIPLY_6_VALUE,
    CG_FPLL_8M_MULTIPLY_10_VALUE,
    CG_FPLL_10M_MULTIPLY_8_VALUE,
    CG_FPLL_12M_MULTIPLY_4_VALUE,
    CG_FPLL_12M_MULTIPLY_6_VALUE,
    CG_FPLL_16M_MULTIPLY_3_VALUE,
    CG_FPLL_16M_MULTIPLY_5_VALUE,
};
#elif defined (TSB_M36BF10 )
static CG_FpllValue fpllValue_table[CG_FPLL_VALUE_MAX] = {
    CG_FPLL_8M_MULTIPLY_8,
    CG_FPLL_8M_10M_MULTIPLY_6,
    CG_FPLL_10M_MULTIPLY_4,
    CG_FPLL_12M_MULTIPLY_5,
    CG_FPLL_12M_16M_MULTIPLY_4,
    CG_FPLL_16M_MULTIPLY_3,
};

static uint32_t numFpllValue_table[CG_FPLL_VALUE_MAX] = {
    CG_FPLL_8M_MULTIPLY_8_VALUE,
    CG_FPLL_8M_10M_MULTIPLY_6_VALUE,
    CG_FPLL_10M_MULTIPLY_4_VALUE,
    CG_FPLL_12M_MULTIPLY_5_VALUE,
    CG_FPLL_12M_16M_MULTIPLY_4_VALUE,
    CG_FPLL_16M_MULTIPLY_3_VALUE,
};
#endif
/** @} */
/* End of group CG_Private_Defines */

/** @defgroup CG_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group CG_Private_FunctionPrototypes */

/** @defgroup CG_Private_Functions
  * @{
  */

/** @} */
/* End of group CG_Private_Functions */

/** @defgroup CG_Exported_Functions
  * @{
  */

/**
  * @brief  Set dividing level between clock fgear and fc.
  * @param  DivideFgearFromFc: Dividing level between fgear and fc.
  *   This parameter can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4, CG_DIVIDE_8, CG_DIVIDE_16
  * @retval None
  */
void CG_SetFgearLevel(CG_DivideLevel DivideFgearFromFc)
{
    uint32_t gear = FC_GEAR_1_1;
    uint32_t regval = TSB_CG->SYSCR;

    /* Check the parameters */
    assert_param(IS_CG_GEAR_DIVIDE_LEVEL(DivideFgearFromFc));

    /* Set the value of fgear */
    switch (DivideFgearFromFc) {
    case CG_DIVIDE_1:
        gear = FC_GEAR_1_1;
        break;
    case CG_DIVIDE_2:
        gear = FC_GEAR_1_2;
        break;
    case CG_DIVIDE_4:
        gear = FC_GEAR_1_4;
        break;
    case CG_DIVIDE_8:
        gear = FC_GEAR_1_8;
        break;
    case CG_DIVIDE_16:
        gear = FC_GEAR_1_16;
        break;
    default:
        /* Do nothing */
        break;
    }

    regval &= CG_FC_GEAR_MASK;
    regval |= gear;
    TSB_CG->SYSCR = regval;
}

/**
  * @brief  Get dividing level between clock fgear and fc.
  * @param  None
  * @retval The dividing level between clock fgear and fc
  *   The value returned can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4,
  *   CG_DIVIDE_8, CG_DIVIDE_16 or CG_DIVIDE_UNKNOWN
  */
CG_DivideLevel CG_GetFgearLevel(void)
{
    CG_DivideLevel DivideFgearFromFc = CG_DIVIDE_UNKNOWN;
    uint32_t syscr = TSB_CG->SYSCR;
    syscr &= (~CG_FC_GEAR_MASK);

    switch (syscr) {
    case FC_GEAR_1_1:
        DivideFgearFromFc = CG_DIVIDE_1;
        break;
    case FC_GEAR_1_2:
        DivideFgearFromFc = CG_DIVIDE_2;
        break;
    case FC_GEAR_1_4:
        DivideFgearFromFc = CG_DIVIDE_4;
        break;
    case FC_GEAR_1_8:
        DivideFgearFromFc = CG_DIVIDE_8;
        break;
    case FC_GEAR_1_16:
        DivideFgearFromFc = CG_DIVIDE_16;
        break;
    default:
        /* Do nothing */
        break;
    }

    return DivideFgearFromFc;
}

/**
  * @brief  Set fperiph for PhiT0
  * @param  PhiT0Src: Set PhiT0 Source
  *   This parameter can be one of the following values:
  *   CG_PHIT0_SRC_FGEAR or CG_PHIT0_SRC_FC
  * @retval None
  */
void CG_SetPhiT0Src(CG_PhiT0Src PhiT0Src)
{
    uint32_t regval = 0U;
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_CG_PHIT0_SRC(PhiT0Src));

