clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_cg.c
    if (TSB_CG_OSCCR_WUEF == 0U) {
        state = DONE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Set PLL multiplying value
  * @param  NewValue: PLL multiplying value
  *   This parameter can be one of the following values:
  * For TMPM36BFY
  *   CG_FPLL_8M_MULTIPLY_6, CG_FPLL_8M_MULTIPLY_10,
  *   CG_FPLL_10M_MULTIPLY_8, CG_FPLL_12M_MULTIPLY_4,
  *   CG_FPLL_12M_MULTIPLY_6, CG_FPLL_16M_MULTIPLY_3,
  *   CG_FPLL_16M_MULTIPLY_5
  * For TMPM36BF10
  *   CG_FPLL_8M_MULTIPLY_8, CG_FPLL_8M_10M_MULTIPLY_6,
  *   CG_FPLL_10M_MULTIPLY_4, CG_FPLL_12M_MULTIPLY_5,
  *   CG_FPLL_12M_16M_MULTIPLY_4, CG_FPLL_16M_MULTIPLY_3
  * @retval Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFPLLValue(CG_FpllValue NewValue)
{
    Result retval = ERROR;
    FunctionalState pllon = DISABLE;
    uint32_t i = 0U;
    /* Check the parameters */
    assert_param(IS_CG_FPLL_VALUE(NewValue));
    pllon = CG_GetPLLState();

    if (pllon == ENABLE) {
        retval = ERROR;
    } else {
        for (i = 0U; i < CG_FPLL_VALUE_MAX; i++) {
            if (NewValue == fpllValue_table[i]) {
                TSB_CG->PLLSEL = numFpllValue_table[i];
                retval = SUCCESS;
                break;
            } else {
                /* Do nothing */
            }
        }
    }
    return retval;
}

/**
  * @brief  Get the value of PLL setting
  * @param  None
  * @retval Get the value of PLL setting.
  * For TMPM36BFY
  *   CG_FPLL_8M_MULTIPLY_6, CG_FPLL_8M_MULTIPLY_10,
  *   CG_FPLL_10M_MULTIPLY_8, CG_FPLL_12M_MULTIPLY_4,
  *   CG_FPLL_12M_MULTIPLY_6, CG_FPLL_16M_MULTIPLY_3,
  *   CG_FPLL_16M_MULTIPLY_5, CG_FPLL_MULTIPLY_UNKNOWN
  * For TMPM36BF10
  *   CG_FPLL_8M_MULTIPLY_8, CG_FPLL_8M_10M_MULTIPLY_6,
  *   CG_FPLL_10M_MULTIPLY_4, CG_FPLL_12M_MULTIPLY_5,
  *   CG_FPLL_12M_16M_MULTIPLY_4, CG_FPLL_16M_MULTIPLY_3,
  *   CG_FPLL_MULTIPLY_UNKNOWN
  */
CG_FpllValue CG_GetFPLLValue(void)
{
    CG_FpllValue retval = CG_FPLL_MULTIPLY_UNKNOWN;
    uint32_t pllsel = TSB_CG->PLLSEL;
#ifdef TSB_M36BFY
    CG_FpllValue i = CG_FPLL_8M_MULTIPLY_6;
#elif defined (TSB_M36BF10 )
    CG_FpllValue i = CG_FPLL_8M_MULTIPLY_8;
#endif

    pllsel &= CG_PLLSET_VALUE_MASK;

#ifdef TSB_M36BFY
    for (i = CG_FPLL_8M_MULTIPLY_6; i < CG_FPLL_VALUE_MAX; i++) {
#elif defined (TSB_M36BF10 )
    for (i = CG_FPLL_8M_MULTIPLY_8; i < CG_FPLL_VALUE_MAX; i++) {
#endif
        if (pllsel == numFpllValue_table[i]) {
            retval = i;
            break;
        } else {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Enable PLL or disable it.
  * @param  NewState: New state of PLL
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetPLL(FunctionalState NewState)
{
    Result retval = ERROR;
    CG_FcSrc fcsrc = CG_FC_SRC_FPLL;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_OSCCR_PLLON = 1U;
        retval = SUCCESS;
    } else {
        fcsrc = CG_GetFcSrc();
        if (fcsrc == CG_FC_SRC_FOSC) {  /* PLL is not used. So it can be shut off */
            /* Set register to disable PLL */
            TSB_CG_OSCCR_PLLON = 0U;
            retval = SUCCESS;
        } else {                /*fcsrc == CG_FC_SRC_FPLL. PLL is in use, so disabling it should be invalid */
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Get the status of PLL operation
  * @param  None
  * @retval Run or stop
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetPLLState(void)
{
    FunctionalState pllstate = DISABLE;

    if (TSB_CG_OSCCR_PLLON == 1U) {
        pllstate = ENABLE;
    } else {
        /* Do nothing */
    }

    return pllstate;
}

/**
  * @brief  Enable or disable high-speed oscillator (fosc)
  * @param  Source: Select clock source for fosc
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC_EXT or CG_FOSC_OSC_INT
  * @param  NewState: oscillator is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval Success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFosc(CG_FoscSrc Source, FunctionalState NewState)
{
    CG_FoscSrc fosc_src = CG_FOSC_OSC_INT;
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_CG_FOSC_STATE(Source));

    switch (Source) {
    case CG_FOSC_OSC_EXT:
        if (NewState == ENABLE) {
            /* Enable external high-speed oscillator */
            TSB_CG_OSCCR_XEN1 = 1U;
            /*Selects external high-speed oscillator */
            TSB_CG_OSCCR_EHOSCSEL = 1U;
            retval = SUCCESS;
        } else {
            fosc_src = CG_GetFoscSrc();
            if (fosc_src == CG_FOSC_OSC_EXT) {
                /* external oscillator is in  use, so it can't be disabled */
                retval = ERROR;
            } else {
                /* Disable external high-speed oscillator */
                TSB_CG_OSCCR_XEN1 = 0U;
                retval = SUCCESS;
            }
        }

        break;
    case CG_FOSC_OSC_INT:
        if (NewState == ENABLE) {
            /* Enable internal high-speed oscillator */
            TSB_CG_OSCCR_XEN2 = 1U;
            retval = SUCCESS;
        } else {
            fosc_src = CG_GetFoscSrc();
            if (fosc_src == CG_FOSC_OSC_INT) {
                /* internal high-speed oscillator is in  use, so it can't be disabled */
                retval = ERROR;
            } else {
                /* Disable internal high-speed oscillator */
                TSB_CG_OSCCR_XEN2 = 0U;
                retval = SUCCESS;
            }
        }
        break;
    default:
        /* Do nothing */
        break;
    }

    return retval;
}

/**
  * @brief  Set the source of high-speed oscillator (fosc)
  * @param  Source: Select clock source for fosc
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC_EXT , CG_FOSC_CLKIN_EXT or CG_FOSC_OSC_INT
  * @retval None
  */
void CG_SetFoscSrc(CG_FoscSrc Source)
{
    /* Check the parameters */
    assert_param(IS_CG_FOSC_SRC(Source));

    if (Source == CG_FOSC_OSC_INT) {
        /*Selects internal high-speed oscillator */
        TSB_CG_OSCCR_OSCSEL = 0U;
    } else {
        if (Source == CG_FOSC_OSC_EXT) {
            /*Selects external high-speed oscillator */
            TSB_CG_OSCCR_EHOSCSEL = 1U;
            /*Selects external high-speed oscillator */
            TSB_CG_OSCCR_OSCSEL = 1U;
        } else {
            /*Selects an external clock input */
            TSB_CG_OSCCR_EHOSCSEL = 0U;
            /*Selects external high-speed oscillator */
            TSB_CG_OSCCR_OSCSEL = 1U;
        }
    }
}

/**
  * @brief  Get the source of high-speed oscillator (fosc)
  * @param  None
  * @retval Source of fosc
  *   The value returned can be one of the following values:
  *   CG_FOSC_OSC_EXT , CG_FOSC_CLKIN_EXT or CG_FOSC_OSC_INT
  */
CG_FoscSrc CG_GetFoscSrc(void)
{
    CG_FoscSrc fosc_src = CG_FOSC_CLKIN_EXT;

    if (TSB_CG_OSCCR_OSCSEL == 0U) {
        fosc_src = CG_FOSC_OSC_INT;
    } else {
        if (TSB_CG_OSCCR_EHOSCSEL == 1U) {
            fosc_src = CG_FOSC_OSC_EXT;
        } else {
            /* Do nothing */
        }
    }

    return fosc_src;
}

/**
  * @brief  Get the state of high-speed oscillator (fosc)
  * @param  Source: Select fosc source
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC_EXT or CG_FOSC_OSC_INT
  * @retval State of fosc
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetFoscState(CG_FoscSrc Source)
{
    FunctionalState state = DISABLE;

    /* Check the parameters */
    assert_param(IS_CG_FOSC_STATE(Source));

    if (Source == CG_FOSC_OSC_EXT) {
        if (TSB_CG_OSCCR_XEN1 == 1U) {
            state = ENABLE;
        } else {
            /* Do nothing */
        }
    } else if (TSB_CG_OSCCR_XEN2 == 1U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}


/**
  * @brief  Set to the specified low-power mode
  * @param  Low power mode
  *   The value can be one of the following values:
  *   CG_STBY_MODE_STOP1, CG_STBY_MODE_IDLE, CG_STBY_MODE_STOP2
  * @retval None
  */
void CG_SetSTBYMode(CG_STBYMode Mode)
{
    uint32_t regval = TSB_CG->STBYCR;

    /* Check the parameter */
    assert_param(IS_CG_STBY_MODE(Mode));

    regval &= CG_STBY_MODE_MASK;
    regval |= (uint32_t) Mode;
    regval &= CG_STBY_WRITE0_MASK;      /* CGSTBYCR bit 19, 18 write "0"  */

    TSB_CG->STBYCR = regval;
}

/**
  * @brief  Get the low-power consumption mode
  * @param  None
  * @retval Low power mode
  *   The value returned can be one of the following values:
  *   CG_STBY_MODE_STOP1, CG_STBY_MODE_IDLE, 
  *   CG_STBY_MODE_STOP2, CG_STBY_MODE_UNKNOWN
  */
CG_STBYMode CG_GetSTBYMode(void)
{
    CG_STBYMode stby_mode = CG_STBY_MODE_UNKNOWN;
    uint8_t regval = (uint8_t) (TSB_CG->STBYCR & (~CG_STBY_MODE_MASK));

    stby_mode = numToSTBYMode_table[regval];

